3rparties/artillery/soap-benchmark.yml
# ---------------------------------------------------------------------------
# Artillery SOAP benchmark – SAX vs XPath body-fingerprint performance
#
# Compares the throughput and latency of Speedis when generating POST cache
# keys via the SAX parser (xmlsax:xmlBodyFingerprint) versus the DOM/XPath
# parser (xmlxpath:xpathBodyFingerprint) under three payload sizes:
#
#   small  ~300 B   – single getProduct call
#   medium ~2 KB    – getProductList, 15 items
#   large  ~15 KB   – getProductList, 150 items
#
# Run a single scenario to get clean, isolated metrics:
#
# docker run --rm -it \
#   --network speedis_default \
#   -v $(pwd)/3rparties/artillery:/scripts \
#   artilleryio/artillery:latest \
#   run --scenario-name sax-small /scripts/soap-benchmark.yml
#
# docker run --rm -it \
#   --network speedis_default \
#   -v $(pwd)/3rparties/artillery:/scripts \
#   artilleryio/artillery:latest \
#   run --scenario-name xpath-large /scripts/soap-benchmark.yml
#
# Run all scenarios together for a mixed-load comparison:
# docker run --rm -it \
#   --network speedis_default \
#   -v $(pwd)/3rparties/artillery:/scripts \
#   artilleryio/artillery:latest \
#   run /scripts/soap-benchmark.yml
#
# Prerequisites:
#   - Stack running (docker compose up)
#   - uuids.csv present in this directory (used by the existing load tests)
# ---------------------------------------------------------------------------

config:
  target: "https://haproxy"
  tls:
    rejectUnauthorized: false
  http:
    timeout: 10
    pool: 4096
    # extendedMetrics: true
  processor: "./soap-benchmark-processor.cjs"
  payload:
    path: "uuids.csv"
    fields:
      - "requestId"
    order: random
  phases:
    - name: 'low-load'
      duration: 1m
      arrivalRate: 1000
    - name: 'medium-load'
      duration: 1m
      arrivalRate: 2000
    - name: 'high-load'
      duration: 15m
      arrivalRate: 4000
scenarios:
  # ── SAX ──────────────────────────────────────────────────────────────────
  - name: "sax-small"
    beforeScenario:
      - "setSmallSoapBody"
    flow:
      - post:
          url: "/mocks/public/soap/sax?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ soapBody }}"
  - name: "sax-medium"
    beforeScenario:
      - "setMediumSoapBody"
    flow:
      - post:
          url: "/mocks/public/soap/sax?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ soapBody }}"
  - name: "sax-large"
    beforeScenario:
      - "setLargeSoapBody"
    flow:
      - post:
          url: "/mocks/public/soap/sax?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ soapBody }}"
  # ── XPath ─────────────────────────────────────────────────────────────────
  - name: "xpath-small"
    beforeScenario:
      - "setSmallSoapBody"
    flow:
      - post:
          url: "/mocks/public/soap/xpath?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ soapBody }}"
  - name: "xpath-medium"
    beforeScenario:
      - "setMediumSoapBody"
    flow:
      - post:
          url: "/mocks/public/soap/xpath?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ soapBody }}"
  - name: "xpath-large"
    beforeScenario:
      - "setLargeSoapBody"
    flow:
      - post:
          url: "/mocks/public/soap/xpath?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ soapBody }}"