3rparties/artillery/soap-benchmark.yml
# ---------------------------------------------------------------------------
# Artillery SOAP benchmark – SAX vs XPath body-fingerprint performance
#
# Compares the throughput and latency of Speedis when generating POST cache
# keys via the SAX parser (xmlsax:xmlBodyFingerprint) versus the DOM/XPath
# parser (xmlxpath:xpathBodyFingerprint) under three payload sizes:
#
# Run a single scenario to get clean, isolated metrics:
#
# docker run --rm -it \
#   --network speedis_default \
#   -v $(pwd)/3rparties/artillery:/scripts \
#   artilleryio/artillery:latest \
#   run --scenario-name sax-small /scripts/soap-benchmark.yml
#
# docker run --rm -it \
#   --network speedis_default \
#   -v $(pwd)/3rparties/artillery:/scripts \
#   artilleryio/artillery:latest \
#   run --scenario-name xpath-large /scripts/soap-benchmark.yml
#
# Run all scenarios together for a mixed-load comparison:
# docker run --rm -it \
#   --network speedis_default \
#   -v $(pwd)/3rparties/artillery:/scripts \
#   artilleryio/artillery:latest \
#   run /scripts/soap-benchmark.yml
#
# Prerequisites:
#   - Stack running (docker compose up)
#   - soap-payloads-{small,medium,large}.csv present in this directory
#     (generate with: node generate-soap-payloads.cjs)
# ---------------------------------------------------------------------------

config:
  target: "https://haproxy"
  tls:
    rejectUnauthorized: false
  http:
    timeout: 10
    pool: 4096
    # extendedMetrics: true
  payload:
    - path: "soap-payloads-small.csv"
      fields:
        - "smallSoapBody"
    - path: "soap-payloads-medium.csv"
      fields:
        - "mediumSoapBody"
    - path: "soap-payloads-large.csv"
      fields:
        - "largeSoapBody"
  phases:
    - name: 'low-load'
      duration: 1m
      arrivalRate: 1000
    - name: 'medium-load'
      duration: 1m
      arrivalRate: 2000
    - name: 'high-load'
      duration: 15m
      arrivalRate: 4000
scenarios:
  # ── SAX ──────────────────────────────────────────────────────────────────
  - name: "sax-small"
    flow:
      - post:
          url: "/mocks/public/soap/sax?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ smallSoapBody }}"
  - name: "sax-medium"
    flow:
      - post:
          url: "/mocks/public/soap/sax?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ mediumSoapBody }}"
  - name: "sax-large"
    flow:
      - post:
          url: "/mocks/public/soap/sax?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ largeSoapBody }}"
  # ── XPath ─────────────────────────────────────────────────────────────────
  - name: "xpath-small"
    flow:
      - post:
          url: "/mocks/public/soap/xpath?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ smallSoapBody }}"
  - name: "xpath-medium"
    flow:
      - post:
          url: "/mocks/public/soap/xpath?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ mediumSoapBody }}"
  - name: "xpath-large"
    flow:
      - post:
          url: "/mocks/public/soap/xpath?delay={{ $randomNumber(100,200) }}&cc=public,max-age=10"
          headers:
            Host: "mocks"
            Content-Type: "text/xml; charset=utf-8"
          body: "{{ largeSoapBody }}"